constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            inlet;
        nFaces          100;
        startFace       29531;
        faces           ( ( 0 4 7 3 ) );
    }
    outlet
    {
        type            outlet;
        nFaces          110;
        startFace       29631;
        faces           ( ( 2 6 5 1 ) );
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       29741;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          15014;
        startFace       29941;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          15014;
        startFace       44955;
    }
    vanem
    {
        type            wall;
        inGroups        1(wall);
        nFaces          786;
        startFace       59969;
    }
    vaneu
    {
        type            wall;
        inGroups        1(wall);
        nFaces          790;
        startFace       60755;
    }
    vanel
    {
        type            wall;
        inGroups        1(wall);
        nFaces          790;
        startFace       61545;
    }
)

// ************************************************************************* //
