system/meshParameters
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
xin   0;
yinl   -0.5;
yinu   0.5;
xout   4;
youtl   -2.19;
youtu   2.19;
hm   100;
vm   100;
